Tekla.Structures.Model.GeometrySectionEnumerator
The GeometrySectionEnumerator class is used to enumerate the geometry sections of a bent plate geometry.

Tekla.Structures.Model.GeometrySectionEnumerator.nodeIndexList
The list of geometry sections.

Tekla.Structures.Model.GeometrySectionEnumerator.position
The enumerator position.

Tekla.Structures.Model.GeometrySectionEnumerator.#ctor(System.Collections.Generic.Dictionary{System.Int32,Tekla.Structures.Model.IGeometryNode})
Initializes a new instance of the Tekla.Structures.Model.GeometrySectionEnumerator class.
This constructor should only be called from connective geometry.
nodes: The collection containing nodes to enumerate.

Tekla.Structures.Model.GeometrySectionEnumerator.Current
Gets the current geometry section.

Tekla.Structures.Model.GeometrySectionEnumerator.System#Collections#IEnumerator#Current
Gets the current geometry section.

Tekla.Structures.Model.GeometrySectionEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Model.GeometrySectionEnumerator.Reset
Resets the enumerator to the beginning.